src/main/resources/ChangePasswordRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://schemas.ppsr.gov.au/2011/04/data" 
xmlns:ns2="http://schemas.ppsr.gov.au/2011/04/services" 
xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<SOAP-ENV:Header>
	<ns3:Security SOAP-ENV:mustUnderstand="1">
	<ns3:UsernameToken>
		<ns3:Username>DISC-PEPA</ns3:Username>
		<ns3:Password>)s0&amp;PD!cXN</ns3:Password>
	</ns3:UsernameToken>
	</ns3:Security>
	<ns2:TargetEnvironment>Discovery</ns2:TargetEnvironment>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
	<ns2:ChangeB2GPasswordRequestMessage>
		<ns2:ChangeB2GPasswordRequest>
			<ns1:CustomersRequestMessageId>2014021110052500000016</ns1:CustomersRequestMessageId>
			<ns1:CustomersUserDefinedFields>
				<ns1:CustomersUserDefinedField>
					<ns1:FieldName>QueID</ns1:FieldName>
					<ns1:FieldValue>1</ns1:FieldValue>
				</ns1:CustomersUserDefinedField>
			</ns1:CustomersUserDefinedFields>
			<ns1:Username>DISC-PEPA</ns1:Username>
			<ns1:NewPassword>)k0&amp;PD!cXY</ns1:NewPassword>
		</ns2:ChangeB2GPasswordRequest>
	</ns2:ChangeB2GPasswordRequestMessage>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>